In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
s = pd.Series(sdata)
s

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [11]:
states = {'California','Ohio','Oregon','Texas'}
st = pd.Series(sdata,states)
st

Texas         71000.0
California        NaN
Oregon        16000.0
Ohio          35000.0
dtype: float64

In [12]:
pd.isnull(st)

Texas         False
California     True
Oregon        False
Ohio          False
dtype: bool

In [15]:
a = {'c0':[2,3,5,8],
     'c1':[12,76,32,29]
    }
b = ['a', 'b', 'c', 'd']
s = pd.DataFrame(a)
s

   c0  c1
0   2  12
1   3  76
2   5  32
3   8  29

In [16]:
s2 = pd.DataFrame(a,b)
s2

   c0  c1
a   2  12
b   3  76
c   5  32
d   8  29

In [21]:
s2.iloc[2]

c0     5
c1    32
Name: c, dtype: int64

In [22]:
s2.loc['a']

c0     2
c1    12
Name: a, dtype: int64

In [41]:
sales = {"Day":["M","T","W","Th","F"], "Visitors":[43,45,33,43,78], "Revenue":[64,73,62,64,53] }
df=pd.DataFrame(sales)
df

  Day  Visitors  Revenue
0   M        43       64
1   T        45       73
2   W        33       62
3  Th        43       64
4   F        78       53

In [42]:
df = df.set_index('Day')
df

     Visitors  Revenue
Day
M          43       64
T          45       73
W          33       62
Th         43       64
F          78       53

In [31]:
df.loc[['M','F']]

     Visitors  Revenue
Day
M          43       64
F          78       53

In [44]:
df['Visitors']

Day
M     43
T     45
W     33
Th    43
F     78
Name: Visitors, dtype: int64

In [35]:
df[df['Revenue']>65]

     Visitors  Revenue
Day
T          45       73

In [52]:
df2 = pd.DataFrame(df, columns = ['Visitors', 'Revenue', 'Debt'])
df2

     Visitors  Revenue  Debt
Day
M          43       64   NaN
T          45       73   NaN
W          33       62   NaN
Th         43       64   NaN
F          78       53   NaN
S          92       87   NaN

In [53]:
df2.drop('Debt', axis=1)

     Visitors  Revenue
Day
M          43       64
T          45       73
W          33       62
Th         43       64
F          78       53
S          92       87

In [63]:
df.loc['S'] = [92,87]
df

     Visitors  Revenue
Day
M          43       64
T          45       73
W          33       62
Th         43       64
F          78       53
S          92       87

In [64]:
df.drop('S', axis = 0)

     Visitors  Revenue
Day
M          43       64
T          45       73
W          33       62
Th         43       64
F          78       53

In [68]:
df.corr()

          Visitors   Revenue
Visitors  1.000000  0.394665
Revenue   0.394665  1.000000

In [75]:
movies = pd.read_csv('movies.csv')
#movies = pd.read_csv('movies.csv', index_col = 'movieId')
movies = movies.set_index('movieId')
movies

,title,genres
movieId,,
1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,Jumanji (1995),Adventure|Children|Fantasy
3,Grumpier Old Men (1995),Comedy|Romance
4,Waiting to Exhale (1995),Comedy|Drama|Romance
5,Father of the Bride Part II (1995),Comedy
...,...,...
193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
193585,Flint (2017),Drama
193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
193609,Andrew Dice Clay: Dice Rules (1991),Comedy